Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཀྱང་དགེ་བའི་རྩ་བ་འདིས་སེམས་ཅན་འཁོར་བའི་འབྲོག་དགོན་པ་ན་འཐོམས་པ་ངན་སོང་ཐམས་ཅད་ཀྱི་ལམ་དུ་ཞུགས་པ་རྣམས་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཡོངས་སུ་བཀྲོལ་ཏེ་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པས། བདེ་བ་ཐམས་ཅད་མཁྱེན་པའི་ལམ་ལ་རབ་ཏུ་དགོད་པར་བྱ་བར་ཤོག་ཤིག་པར་བསྐྱེད་དེ།
en: “In my mind there arises this thought: ‘Through this root of merit, may I free from all suffering and bring to the great good fortune of the path to happiness and omniscience those beings who are lost in the remote wilderness of saṃsāra and are following the path to all the lower realms.’

source: རིགས་ཀྱི་བུ་ཡུལ་དང་ལྗོངས་ལ་ཆགས་པའི་སེམས་ཅན་མངོན་པར་ཆགས་པའི་རྒྱུ་ལས་བྱུང་བའི་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་གྱུར་པ་རྣམས་ལའང་ཁོ་མོ་ནི་སྐྱོ་བར་བྱ་བའི་ཐབས་སྣ་ཚོགས་ཀྱིས་ཡུལ་ལ་མངོན་པར་ཆགས་པ་དེ་ལས་གྱེན་དུ་བསྐྱོད་པར་བྱེད་དེ་སེམས་ཀྱང་འདི་ལྟར་དགེ་བའི་རྩ་བ་འདིས་སེམས་ཅན་ཐམས་ཅད་ཕུང་པོ་ལ་མངོན་པར་ཆགས་པ་ལས་གྱེན་དུ་བསྐྱོད་དེ།
en: “Noble one, through various methods that bring disillusionment, I free from attachment to their homeland those beings in homelands who experience suffering caused by that attachment.

source: གནས་མེད་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་དགོད་པར་བྱ་བར་ཤོག་ཤིག་པར་བསྐྱེད་དོ། །
en: “In my mind there arises this aspiration: ‘Through this root of merit, may I free all beings from attachment to the skandhas and bring them to the wisdom of omniscience that has no location.’

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་གྲོང་ན་སྤྱོད་པའི་སེམས་ཅན་ཁྱིམ་དང་གནས་ཀྱི་འཆིང་བས་གླགས་པ་རྣམས་མཚན་མོ་མུན་པ་ཤིན་ཏུ་གནག་པས་ཆོད་པའི་ནང་ན་ཁྱིམ་གྱི་དོན་སྣ་ཚོགས་ཉམས་སུ་གནོད་པས། སྡུག་བསྔལ་བར་གྱུར་པ་རྣམས་ཀྱང་སྐྱོ་བར་འགྱུར་བའི་སྒོ་སྣ་ཚོགས་ཀྱིས་སྐྱོ་བར་བྱས་ཏེ།
en: “Noble one, the beings who dwell in villages, who are destroyed by their bondage to house and home, who are bewildered in the darkness of the night, and who suffer because of the various demands of their homes—through various ways of causing distress, I bring them to disillusionment.

source: ཆགས་པ་མེད་པའི་སེམས་ཡོངས་སུ་བསྐྱེད་ནས།
en: I cause them to develop a mind free of attachment.

source: ཆོས་ཀྱི་སྦྱིན་པས་ཡོངས་སུ་བཟུང་སྟེ།
en: I care for them through the gift of the Dharma.

source: ཚིམ་པར་བྱས་ནས་རྟེན་པ་མེད་པའི་ཆོས་ལ་བཀོད་དེ།
en: I make them perfectly content and establish them in the Dharma that has no home.

source: སེམས་ཀྱང་འདི་ལྟར་དགེ་བའི་རྩ་བ་འདིས་སེམས་ཅན་སྐྱེ་མཆེད་དྲུག་གི་གྲོང་ལ་གནས་པ་རྣམས་འཁོར་བའི་ལམ་གྱི་རྒྱུད་ཀྱི་སྤྱོད་ཡུལ་ལས་གྱེན་དུ་བསྐྱོད་དེ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་ལ་དགོད་པར་བྱ་བར་ཤོག་ཤིག་པར་བསྐྱེད་དོ། །
en: “In my mind there arises this thought: ‘Through this root of merit, may I free all beings dwelling in the town of their six āyatanas from the realm of activity that is existence in saṃsāra, and may I establish them in the realm of activity of the wisdom of omniscience.’

source: རིགས་ཀྱི་བུ་གང་ཡང་མཚན་མོ་མུན་པ་ཤིན་ཏུ་གནག་པའི་ནང་ན། ཤར་ཕྱོགས་ལ་སོགས་པའི་ཕྱོགས་དང་། ཕྱོགས་མཚམས་རེ་རེར་ཕྱོགས་བསླད་པར་གྱུར་པ། སའི་ཕྱོགས་མཉམ་པ་ལ་མི་མཉམ་པའི་གཡང་སར་འདུ་ཤེས་པ་དང་། སྒང་བུ་ལ་གཤོང་དུ་འདུ་ཤེས་པར་གྱུར་ཏེ།
en: “Noble one, through various methods I bring illumination to those beings who are bewildered in the darkness of night in the east and other directions and intermediate directions, who see level areas as being uneven with chasms, who perceive high ground as depressions and depressions as high ground, and who are bewildered as to the directions of paths and areas.

source: ཕྱོགས་ཀྱི་ལམ་དང་ས་ཚོད་ལ་མགོ་འཁོར་བར་གྱུར་པ་དེ་དག་ལའང་ཁོ་མོ་ནི་ཐབས་སྣ་ཚོགས་ཀྱིས་སྣང་བར་བྱས་ཏེ།
en: I reveal a door to those who wish to exit.

source: ཕྱིར་འབྱུང་བ་རྣམས་ལ་ནི་སྒོ་ཡོངས་སུ་སྟོནཏོ། །
en: I reveal a path to those who wish to go upon it.

source: གྲོལ་བར་འདོད་པར་རྣམས་ལ་ནི་མུ་སྟེགས་ཡོངས་སུ་སྟོན་ཏོ། །
en: I reveal a ford to those who wish to cross a river.

source: རྒྱལ་པར་འདོད་པ་རྣམས་ལ་ནི་གྲུ་ཡོངས་སུ་སྟོན་ཏོ། །
en: I reveal a ship to those who wish to cross the sea.

source: ཁྱིམ་དུ་འགྲོ་བར་འདོད་པ་རྣམས་ལ་ནི་ཁྱིམ་ཡོངས་སུ་སྟོན་ཏོ། །
en: I reveal a house to those who wish to go inside.

source: རྣམ་པར་བལྟ་བར་འདོད་པ་རྣམས་ལ་ནི་ཕྱོགས་ཡོངས་སུ་སྟོན་ཏོ། །
en: I reveal a region to those who wish to see it.

source: ས་གཞི་མཐོ་བ་དང་། དམའ་བ་ཡང་ཡོངས་སུ་སྟོན་ཏོ། །
en: I reveal the high ground and the low ground.

source: སའི་ཕྱོགས་མཉམ་པ་དང་། མི་མཉམ་པ་དང་། གཟུགས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་ཀྱང་ཡོངས་སུ་སྟོན་ཏོ། །
en: I reveal the areas that are level, those that are not level, and their various forms.

source: ལམ་གྱིས་དུབ་པ་རྣམས་ལ་གྲོང་དང་གྲོང་ཁྱེར་དང་ལྗོངས་དང་ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཀྱང་ཡོངས་སུ་སྟོན་ཏོ། །
en: I reveal villages, towns, markets, kingdoms, and capitals to exhausted travelers.

source: ཚ་བ་དང་སྐོམ་པས་མནར་བ་རྣམས་ལ་ཡང་མཚོ་དང་མཚེའུ་དང་། ལུ་མ་དང་རྫིང་དང་རྫིང་བུ་དང་ཆུ་ཀླུང་དང་། ནགས་ཚལ་དང་བཟའ་ཤིང་གི་ར་བ་དང་། ཀུན་དགའ་ཡིད་དུ་འོང་བ་ཡོངས་སུ་སྟོན་ཏོ། །
en: I reveal springs, ponds, lakes, reservoirs, lotus ponds, rivers, forests, orchards, and gardens to those afflicted by heat and thirst.

source: སྡུག་པ་དང་བྲལ་ཞིང་ཕྲད་པར་འདོད་པ་རྣམས་ལ་ཕ་དང་མ་དང་བུ་དང་ཆུང་མ་དང་། མཛའ་བོ་དང་། བློན་པོ་དང་། གཉེན་བཤེས་དང་ཡིད་དུ་འོང་བའི་གཟུགས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་ཏོ། །
en: I reveal pleasant forms of various kinds such as father, mother, children, wives, friends, families, and relatives to those who wish to meet the beloved they are separated from.

source: སེམས་ཀྱང་ཇི་ལྟར་བདག་གིས་སེམས་ཅན་མཚན་མོ་མུན་པ་མུན་ནག་གིས་ཆོད་པ། མིག་རབ་རིབ་ཀྱིས་ཉམས་པ། ཕྱོགས་བསླད་པ། ལམ་འཁོར་བ་རྣམས་ལ་གཟུགས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་རྣམ་པར་དམིགས་པར་བྱ་བའི་ཕྱིར། སྣང་བ་བསྐྱེད་དེ། འོད་བྱས་པ་དེ་བཞིན་དུ་བདག་གིས་ཡུན་རིང་པོ་ནས་འཁོར་བའི་མུན་པ་ན་གནས་པའི་སེམས་ཅན་ཡང་དག་པ་ཉིད་ཀྱི་ཕྱོགས་ལ་བསླད་པ་མ་རིག་པའི་མུན་པར་འཐོམས་པ་ཡེ་ཤེས་ཀྱི་མིག་མི་ཤེས་པའི་ལིང་ཏོག་གིས་ཆོད་པ། འདུ་ཤེས་དང་། སེམས་དང་ལྟ་བས་བྱིན་ཅི་ལོག་ཏུ་གྱུར་པ། མི་རྟག་པ་ལ་རྟག་པར་འདུ་ཤེས་པ། སྡུག་བསྔལ་བ་ལ་བདེ་བར་འདུ་ཤེས་པ། བདག་མེད་པ་ལ་བདག་ཏུ་འདུ་ཤེས་པ། མི་སྡུག་པ་ལ་སྡུག་པར་འདུ་ཤེས་པ། བདག་དང་སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། གང་ཟག་ཏུ་འཛིན་པ་དམ་པོ་ལ་གནས་པ། ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ལ་གནས་པ། རྒྱུ་དང་འབྲས་བུ་ལ་མགོ་འཁོར་བ། མི་དགེ་བའི་ལས་ཀྱི་ལམ་གྱི་ཕྱོགས་སུ་ཞུགས་པ། སྲོག་གཅོད་པ། མ་བྱིན་པར་ལེན་པ། འདོད་པས་ལོག་པར་གཡེམ་པ། བརྫུན་དུ་སྨྲ་བ། ཕྲ་མ་ཟེར་བ། ངག་རྩུབ་པོ་འབྱིན་པ། ཚིག་ཀྱལ་བ་སྨྲ་བ།
en: “In my mind there arises this thought: ‘May I bring light and illumination, so that they will perceive the various forms around them, to those who are bewildered in the darkness of night, whose eyes are afflicted by blindness, and who are bewildered as to directions.

source: ཆགས་སེམས་དང་ལྡན་པ། གནོད་སེམས་ཀྱི་སེམས་དང་ལྡན་པ། ལོག་པར་ལྟ་བ་ཅན། ཕར་མི་ཤེས་པ། མར་མི་ཤེས་པ། དགེ་སྦྱོང་དང་། བྲམ་ཟེར་མི་ཤེས་པ། དབང་པོ་མི་ཤེས་པ། སྐྱེས་བུ་དམ་པར་མི་ཤེས་པ། ཆོས་མ་ཡིན་པ་ལ་ཆགས་ཤིང་ཞེན་པ། མི་ཚུལ་བའི་འདོད་པས་ཟིལ་གྱིས་ནོན་པ། ལོག་པའི་ཆོས་ཀྱིས་ཡོངས་སུ་འཁྲིས་པ། དེ་བཞིན་གཤེགས་པ་ལ་སྐུར་བ་འདེབས་པ། ཆོས་ཀྱི་འཁོར་ལོ་ནུབ་པར་བྱ་བ་ལ་ཞུགས་པ། བདུད་ཀྱི་རྒྱལ་མཚན་འཛིན་པ། བྱང་ཆུབ་སེམས་དཔའ་ལ་གནོད་པར་བྱེད་པ། ཐེག་པ་ཆེན་པོ་ལ་ཞེ་སྡང་བ། བྱང་ཆུབ་ཀྱི་སེམས་ལ་མོས་པ་སྤོང་བར་བྱེད་པ། བྱང་ཆུབ་སེམས་དཔའ་ལ་མི་སྙན་དུ་རྗོད་པ། སྣོད་མ་སྐམས་པར་སྙིང་རིང་བ། གནོད་པ་མ་བྱས་པར་དགྲར་ལེན་པ། འཕགས་པ་ལ་སྐུར་བ་འདེབས་པ། སྐྱེས་བུ་དམ་པ་མ་ཡིན་པས། སྤྱོད་པའི་ཆོས་ཀྱི་སྤྱོད་ཡུལ་ཅན། མཆོད་རྟེན་དང་། དགེ་འདུན་གྱི་དངོས་པོ་ལ་འཁུ་བ། ཕ་མ་ལ་ལོག་པར་སེམས་པ། མཚམས་མེད་པའི་ལས་བྱེད་པ། གཡང་ས་ཆེན་པོ་ལ་མངོན་པར་ལྟས་པའི་སེམས་ཅན་རྣམས་ཀྱི་མ་རིག་པའི་མུན་པ་ཤེས་རབ་ཀྱི་སྣང་བ་ཆེན་པོས་བསལ་ཏེ།
en: “ ‘Similarly, there are beings who have dwelled in the darkness of saṃsāra for a long time who are confused concerning the right direction; who are bewildered in the darkness of ignorance; whose eyes of wisdom are clouded by the cataracts of ignorance; who have incorrect perception, mind, and view; who perceive the impermanent as permanent; who perceive suffering as happiness; who perceive the absence of a self as a self; who perceive the unpleasant as pleasant; who believe in an enduring self, being, soul, person, or individual; who rely on the skandhas, dhātus, and āyatanas; who are confused about cause and result; who follow the path of nonvirtuous actions; who kill; who steal; who engage in sexual misconduct; who lie; who slander; who speak harsh words; who speak meaninglessly; who are covetous; who are malicious; who hold wrong views; who do not respect their fathers; who do not respect their mothers; who do not respect śramaṇas and brahmins; who do not respect the powerful; who do not respect holy beings; who have passion and devotion for what is not the Dharma; who are overcome by inappropriate desires; who are in the bondage of wrong views; who malign the tathāgatas; who engage in bringing the wheel of the Dharma to an end; who hold the banner of Māra; who harm bodhisattvas; who have anger toward the Mahāyāna; who are engaged in reviling the aspiration to enlightenment; who criticize bodhisattvas; who harm or injure their mothers; who are harmful and hostile; who malign the āryas; who practice a religious conduct that is not that of good people; who damage that which belongs to stūpas and the saṅgha; who oppose their parents; who commit the acts with immediate result on death; and who are facing a great abyss.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྐུལ་ནས། ཐེག་པ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོས་སྟོབས་བཅུའི་ཡེ་ཤེས་ཀྱི་སའི་ལམ་ཡོངས་སུ་སྟོན་པར་གྱུར་ཅིག །དེ་བཞིན་གཤེགས་པའི་ས་དང་། དེ་བཞིན་གཤེགས་པའི་ཡུལ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་། སངས་རྒྱས་ཀྱི་ཡུལ་དང་། སྟོབས་བཅུ་ཡོངས་སུ་གྲུབ་པ་དང་།
en: “ ‘May I dispel the darkness of their ignorance with the great light of wisdom, inspire them toward the highest, complete enlightenment, and reveal to them, through the completely good Mahāyāna, the path to the level of the wisdom of the ten strengths, the level of the tathāgatas, the scope of the omniscient wisdom of the tathāgatas, the ocean of the ways of omniscient wisdom, the range of activity of the wisdom of the buddhas, the scope of the buddhas, the accomplishment of the ten strengths, and the strength of the power of retention of the buddhas and the single body of all the buddhas.

source: སངས་རྒྱས་ཀྱི་གཟུངས་ཀྱི་སྟོབས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་མཆོག་ཏུ་གྱུར་པ་ཡོངས་སུ་སྟོན་པར་ཤོག་ཤིག །ཡོངས་སུ་བསྟན་ནས་ཀྱང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཀྱི་གནས་ལ་རབ་ཏུ་དགོད་པར་ཤོག་ཤིག་པར་བསྐྱེད་དོ། །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་སེམས་ཅན་ཡུན་རིང་པོ་ནས་ན་ཞིང་ནད་ཀྱིས་ཡོངས་སུ་སྐྱོ་བ། ལུས་ཉམ་ཆུང་བ་དང་།
en: Having revealed that, may I establish them in the knowledge of the equality of all the buddhas.’

source: རྒས་པ། རྒ་བའི་ཟིལ་གྱིས་ནོན་པ་དང་། མགོན་མེད་པ་དང་། ཕོངས་ཤིང་དབུལ་བ་དང་། ལོག་པར་ལྟུང་བ་དང་། ཡུལ་གཞན་དུ་ཕྱིན་པ་དང་། ཕྱོགས་ལོག་པར་ཞུགས་པ་དང་། བཙོན་ར་ན་འདུག་པ་དང་། ཆད་པས་བཅད་པ་དང་།
en: “Noble one, I am present to save those beings who are sick, who are depressed by being ill for a long time, whose bodies are weakened, who are old, who have been overpowered by old age, who have no protector, who are destitute, who are poor, who are ruined, who have gone astray into another land, who are going in the wrong direction, who are in prison, who are being punished, who are criminals, who are being led to execution, and who are afraid of losing their lives.

source: ཉེས་པ་བྱུང་སྟེ། རྒྱལ་པོས་གསད་པར་བཀྲི་བ་རྣམས་ཀྱང་སྲོག་དང་བྲལ་གྱི་འཇིགས་པ་ལས་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་གནས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་སེམས་ཅན་ནད་པ་རྣམས་ཀྱི་ནད་ཐམས་ཅད་ནི་ཐབས་ཐམས་ཅད་ཀྱིས་གསོ་བ་ནན་ཏན་དུ་བྱེད་དོ། །
en: “Noble one, I am dedicated to using every method to heal all the illnesses of sick beings.

source: རྒས་པ་དང་རྒ་བའི་ཟིལ་གྱིས་ནོན་པ་རྣམས་ལ་ནི་བསྙེན་བཀུར་བ་དང་། རིམ་གྲོ་དང་།
en: I serve and attend those who are old, who are overpowered by old age.

source: ཡོ་བྱད་ཀྱིས་མི་ཕོངས་པར་ཡོངས་སུ་བསྡུད་པ་བྱེད་དོ། །
en: I collect the necessities for life for those who are without them.

source: མགོན་མེད་པའི་སེམས་ཅན་རྣམས་ལ་མགོན་བྱེད་དོ། །
en: I am a protector for beings who have no protector.

source: ཕོངས་ཤིང་དབུལ་བ་རྣམས་ལ་ནི་ནོར་དང་། གསེར་གྱི་ཕུང་པོས་ཡོངས་སུ་སྡུད་དོ། །
en: I gather a mass of wealth and gold for those who are destitute and poor.

source: ལོག་པར་ལྟུང་བ་རྣམས་ནི་དོན་འཐུན་པས་ཡོངས་སུ་སྡུད་དོ། །
en: I gather what is needed for those who are ruined.

source: ཡུལ་གཞན་དུ་ཕྱིན་པ་རྣམས་ནི། རང་གི་ཡུལ་དུ་ཕྱིན་པར་བྱེད་དོ། །
en: I lead those who have gone astray in other lands back to their homelands.

source: ཕྱོགས་ལོག་པར་ཞུགས་པ་རྣམས་ནི། ཕྱོགས་མ་ནོར་བར་འཛུད་དོ། །
en: I take into the correct direction those who follow the wrong direction.

source: བརྩོན་ར་ན་འདུག་པ་རྣམས་ནི་བརྩོན་ར་ནས་ཐར་བར་བྱེད་དོ། །
en: I free from prison those who are in prison.

source: ཆད་པས་གཅད་པ་ནི་ཆད་པའི་སྡུག་བསྔལ་ལས་གྲོལ་བར་བྱེད་དོ། །ཉེས་པ་བྱུང་སྟེ།
en: I free from the suffering of punishment those who are being punished.

source: རྒྱལ་པོས་གསད་པར་བཀྲི་བ་རྣམས་ནི་སྲོག་གི་དབུགས་ཕྱིན་པ་ཐོབ་པར་བྱེད་དོ། །
en: I save the lives of those who are criminals being led to execution.

source: སེམས་ཀྱང་བདག་ཇི་ལྟར་སེམས་ཅན་འདི་དག་འཇིགས་པ་དང་། གནོད་པ་སྣ་ཚོགས་ལས་ཡོངས་སུ་སྐྱོབ་ཅིང་།
en: “In my mind there arises this thought: ‘May I protect and save these beings from these various kinds of fear and harm.

source: མགོན་བྱེད་པ་དེ་བཞིན་དུ་བདག་གིས་འདི་རྣམས་བླ་ན་མེད་པའི་ཆོས་ཀྱི་ཡོངས་སུ་བསྡུ་བས་ཡོངས་སུ་བསྡུས་ཏེ། ཉོན་མོངས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་དགྲོལ་བར་བྱའོ། །
en: Similarly, may I free them from all the kleśas through gathering a collection of the highest Dharmas.

source: སྐྱེ་བ་དང་རྒ་བ་དང་ན་བ་དང་། འཆི་བ་དང་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ལས་ཡང་དག་པར་བཟླ་བར་བྱའོ། །
en: May I cause them to transcend birth, aging, illness, death, misery, wailing, suffering, unhappiness, and torment.

source: ངན་སོང་དང་ལོག་པར་ལྟུང་བའི་འཇིགས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་དགྲོལ་བར་བྱའོ། །
en: May I liberate them from all fear of falling into the lower realms.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་གཟུངས་ལ་རབ་ཏུ་དགོད་པར་བྱའོ། །
en: May I bring them into the care of kalyāṇamitras.

source: ཆོས་རིན་པོ་ཆེ་སྦྱིན་པའི་ཡོངས་སུ་བསྡུ་བས་ཡོངས་སུ་བསྡུ་བར་བྱའོ། །
en: May I gather a collection of the gift of the precious Dharma.

source: ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ལ་རབ་ཏུ་དགོད་པར་བྱའོ། །
en: May I establish them in nontransgressive conduct.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་རྣམ་པར་དག་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱའོ། །
en: May I inspire them toward the pure body of the tathāgatas.

source: རྒ་ཤི་ཡོངས་སུ་མེད་པའི་དབྱིངས་ཤིན་ཏུ་རྟོགས་པ་ལ་རབ་ཏུ་དགོད་པར་བྱ་བར་བསྐྱེད་དོ། །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་སེམས་ཅན་ལོག་པའི་ལམ་ལ་ཞུགས་པ། ལྟ་བའི་རྣམ་པ་ཐིབས་པོ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་པ། ལོག་པར་ལྟ་བའི་སྤྱོད་ཡུལ་ཅན་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཉམ་ང་བར་འགྱུར་བ་ལ་ཡོངས་སུ་སྤྱོད་པ། བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་སྣ་ཚོགས་ལ་གནས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་ཡིན་ཡང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འདུ་ཤེས་པ། ལུས་གདུང་བ་དང་། ཡོངས་སུ་གདུང་བ་ལ་རབ་ཏུ་བརྩོན་པ། མཚོ་དང་། མཚེའུ་དང་། ལུ་མ་དང་།
en: May I establish them in the realization of the essence that is completely free of aging and death.’

source: རྫིང་བུ་དང་། ཆུ་ཀླུང་དང་། རིའི་གཟར་དང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་ལ་འདུད་ཅིང་ཕྱག་འཚལ་བ་མོས་པ། སྡིག་པའི་གྲོགས་པོའི་དབང་དུ་གྱུར་བརྣམས་ལ་ཡང་ཐབས་སྣ་ཚོགས་ཀྱིས་མགོན་དུ་གྱུར་པར་བྱེད་དེ།
en: “Noble one, through various methods I become the protector of those beings who follow wrong paths; who are attached to various dark views; who have the range of activity of incorrect concepts; who engage in dreadful physical, vocal, and mental conduct; who follow various kinds of discipline and asceticism; who view that which is not complete buddhahood as complete buddhahood; who are engaged in paining and tormenting their bodies; who bow down to, pay homage to, and place their trust in lakes, ponds, springs, reservoirs, rivers, precipitous mountains, the directions, and the intermediate directions; and who are under the power of bad companions.

source: དེ་དག་སྡིག་པའི་ལྟ་བའི་རྣམ་པ་དང་། ངན་སོང་ཐམས་ཅད་ཀྱི་གཡང་སར་ལྟུང་བའི་ལམ་ལས་རྣམ་པར་བཟློག་གོ །
en: “I turn them away from evil views and all paths that lead to falling into the abyss of the lower realms.

source: འཇིག་རྟེན་པའི་ཡང་དག་པའི་ལྟ་བ་ལ་རབ་ཏུ་བཀོད་ཅིང་།
en: I establish them in the correct worldly view.

source: ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་ལའང་ཡོངས་སུ་འགོད་དོ། །
en: I establish them in the good fortune of humans and devas.

source: སེམས་ཀྱང་ཇི་ལྟར་བདག་གིས་སེམས་ཅན་འདི་དག་ཉམ་ང་བའི་ནན་ཏན་དང་།
en: “In my mind there arises this thought: ‘May I liberate these beings from dreadful practices and suffering.

source: སྡུག་བསྔལ་ལས་ཡོངས་སུ་བཀྲོལ་བ་དེ་བཞིན་དུ་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱང་། འཕགས་པ་འཇིག་རྟེན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་ལ་བཀོད་དེ།
en: Similarly, may I establish all beings in the noble, transcendent path of the perfections.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པར་བྱས་ལ་ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་ཆེན་པོས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དགོད་པར་བྱའོ། །
en: May I cause them to progress irreversibly toward omniscience and through completely good great prayer bring them to omniscience.

source: སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་མ་དུལ་གྱི་བར་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལས་ཀྱང་མི་གཡོ་བར་བྱ་བར་བསྐྱེད་དོ། །
en: And may I never depart from the level of a bodhisattva until all realms of beings have been guided.’ ”

source: དེ་ནས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པས་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཕྱོགས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྣང་བས་འགྲོ་བ་རྣམ་པར་འདུལ་བའི་སྒོ་འདི་བརྣན་ཏེ། བསྟན་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །གཏི་མུག་མ་རིག་མུན་ནག་བསྩལ་དོན་དུ། །
en: At that time, Vāsantī, the goddess of the night, in order to teach further the bodhisattva liberation called the gateway to guiding beings through the radiance of the Dharma that eliminates the darkness of all beings, through the blessing of the buddhas looked into the ten directions and then recited these verses to Sudhana, the head merchant’s son: “I teach the Dharma so as to benefit beings, In order to dispel the darkness of ignorance and stupidity.

source: སེམས་ཅན་ཕན་ཕྱིར་ཁོ་མོ་ཆོས་བསྟན་ཏེ། །དུས་ལ་བསྡད་ཅིང་འགྲོ་བ་བདེ་བར་བྱས། །
en: I observe the time and bring happiness to beings.

source: འདི་ནི་རྣམ་ཐར་ཚུལ་མཆོག་ཞི་བ་ཡིན། །
en: This is my supreme way of liberation, of peace.

source: ཁོ་མོས་བྱམས་ཡངས་ཤིན་ཏུ་སྤྱད་པ་བྱས། །བསྐལ་པ་མཐའ་ཡས་སྔོན་ཅད་ཤིན་ཏུ་བསྒོམས། །
en: {1} “I have perfectly practiced vast love, Meditating throughout limitless kalpas in the past.

source: དེས་ནི་འཇིག་རྟེན་རྒྱས་བཀང་སྣང་བར་བྱས། །
en: In that way, I have filled the world with illumination.

source: ནོར་བཟངས་བརྟན་པས་ཚུལ་འདི་ཤེས་པར་གྱིས། །
en: Sudhana, know this way well.

source: ཁོ་མོའི་སྙིང་རྗེ་རྒྱ་མཚོ་ཚད་མེད་དེ། །
en: {2} “My ocean of compassion is measureless.

source: འདི་ལས་དུས་གསུམ་རྒྱལ་བ་འཇིག་རྟེན་འབྱུང་། །
en: Through it the jinas of the three times appear in the world.

source: དེས་ནི་འགྲོ་བའི་སྡུག་བསྔལ་ཞི་བར་བྱེད། །
en: Through it the suffering of beings is quelled.

source: ནོར་བཟངས་བརྟན་པས་ཚུལ་འདི་ཤེས་པར་གྱིས།
en: Sudhana, know this way well.

source: འཇིག་རྟེན་བདེ་བ་མངོན་པར་བསྒྲུབ་པ་དང་། །མ་བྱས་འཕགས་པའི་བདེ་བ་མངོན་བསྒྲུབ་ཅིང་། །དེས་ནི་ཁོ་མོ་དགའ་མགུ་རངས་པར་བྱེད། །
en: {3} “Creating worldly happiness And noncomposite, higher bliss Pleases, delights, and gladdens me.

source: རྒྱལ་སྲས་ཁྱོད་ཀྱིས་ཚུལ་འདི་ཤེས་བར་གྱིས། །
en: Jinaputra, understand this way of mine.

source: སངས་རྒྱས་སྟོབས་རྣམས་ཡོངས་སུ་སྦྱོང་བྱེད་ཅིང་། །ཉན་ཐོས་ཡེ་ཤེས་རྣམ་ཐར་འབྲས་བུ་དང་། །འདུས་བྱས་སྐྱོན་ལས་རྟག་ཏུ་ཕྱིར་ཕྱོགས་ཀྱིས། །
en: {4} “Always turned away from composite faults And the wisdom, liberation, and results of the śrāvakas, I purify the strengths of the buddhas.

source: རྒྱལ་སྲས་ཁྱོད་ཀྱིས་ཚུལ་འདི་ཤེས་པར་གྱིས། །
en: Jinaputra, understand this way of mine.

source: ཁོ་མོའི་མིག་ནི་རྒྱ་ཆེ་ཡོངས་སུ་དག དེས་ནི་ཕྱོགས་བཅུའི་ཞིང་རྣམས་མང་པོ་མཐོང་། །
en: {5} “My eyesight is vast and completely pure. With it I see many realms in the ten directions.

source: ཞིང་དབྱིངས་དེ་དག་ཀུན་གྱི་རང་བྱུང་རྣམས། །བྱང་ཆུབ་ཤིང་དབང་དྲུང་ན་བཞུགས་པ་མཐོང་། །
en: I see the self-originated ones in those realms Seated under the lords of Bodhi trees.

source: སངས་རྒྱས་སྐུ་ནི་མཚན་གྱིས་ཡོངས་བརྒྱན་ཅིང་། །འོད་བཟང་རྣམ་པ་སྣ་ཚོགས་ཀུན་འགྱེད་དེ། །བ་སྤུ་ཀུན་ནས་འོད་གཟེར་མང་འགྱེད་པའི། །སངས་རྒྱས་འཁོར་དང་བཅས་པ་ཁོ་མོས་མཐོང་། །
en: {6} “I see the buddhas and their assemblies, The buddhas’ bodies beautified by signs, Emanating multicolored beautiful light rays, A multitude of light rays emanating from all their pores.

source: ཞིང་དབྱིངས་དེ་དག་ཀུན་གྱི་སེམས་ཅན་རྣམས། །ཤི་འཕོ་སྐྱེ་བའི་སྒོར་ཡང་ཀུན་མཐོང་སྟེ། །བྱིས་པ་དེ་དག་འགྲོ་རྒྱུད་རྒྱ་མཚོ་ན། །འཁོར་ཞིང་རང་རང་ལས་ཀྱང་མྱོང་པར་བྱེད། །
en: {7} “I see the beings within those realms And their entrances into death and rebirth, Those foolish ones who in those oceans of existences Continue in saṃsāra and experience the results of their actions.

source: ཁོ་མོའི་རྣ་བ་རྒྱ་མཚོ་རྣམ་དག་སྟེ། །དེར་ནི་སྒྲ་རྣམས་མ་ལུས་ཡོངས་སུ་འདུ། །
en: {8} “Completely pure is the ocean of my hearing In which are gathered all sounds without exception.

source: འགྲོ་བ་ཀུན་ཀྱི་སྒྲ་སྐད་རྒྱ་མཚོ་དག །ཀུན་ཀྱང་ཐོས་ནས་དྲན་པས་ཡོངས་སུ་འཛིན། །
en: I hear and hold in my memory The entire ocean of the languages in all worlds.

source: དབྱངས་ཀྱི་ཡན་ལག་སྒྲ་སྐད་ཐམས་ཅད་ཀྱིས། །དཔེ་ཟླ་མེད་པའི་གསུང་ནི་རབ་བརྒྱན་ཏེ། །དེས་ནི་རྒྱལ་བ་འཁོར་ལོ་རབ་ཏུ་བསྐོར། །དེ་དག་ཁོ་མོས་ཐོས་ཤིང་དྲན་པས་འཛིན། །
en: {9} “The speech beyond analogy or equal, Adorned by all aspects of speech and all sounds, The wheel that is turned by the jinas I hear and hold in my memory.

source: ཁོ་མོའི་སྣ་ཡི་མཐུ་ཡང་རྣམ་དག་སྟེ། །
en: {10} “My power of smell also is completely pure.

source: ཆོས་ཚུལ་རྒྱ་མཚོ་དག་ལ་ཐོགས་པ་མེད། །རྣམ་ཐར་གནས་རྣམས་ཀུན་ཏུ་རབ་འཇུག་པའི། །ཚུལ་འདི་རྒྱལ་སྲས་ཁྱོད་ཀྱིས་ཤེས་པར་གྱིས། །
en: Jinaputra, understand this way that is The entrance to dwelling in all liberations, Without impediment, in the ocean of the ways of the Dharma.

source: ཁོ་མོའི་ལྕེ་ནི་རྒྱ་ཆེ་རབ་ཏུ་ཡངས། །སྲབ་ཅིང་མདོག་དམར་རིན་ཆེན་འོད་དུ་དག །
en: {11} “My tongue is vast and extensive, Subtle, red, and shining like a jewel.

source: སེམས་ཅན་བསམ་པ་ཇི་བཞིན་དེ་ཤེས་བྱེད། །རྒྱལ་སྲས་ཁྱོད་ཀྱིས་ཚུལ་འདི་ཤེས་པར་གྱིས། །
en: Jinaputra, understand this way through which I know the thoughts of beings.

source: ཁོ་མོའི་ཆོས་ལུས་ཤིན་ཏུ་རྣམ་དག་སྟེ། །
en: {12} “My Dharma body is completely pure.

source: དུས་གསུམ་ཀུན་ཏུ་འོད་གསལ་རབ་ཏུ་གནས། །གཟུགས་ལུས་སེམས་ཅན་བསམ་པ་ཇི་བཞིན་ཏེ། །དེ་དག་ཀུན་གྱི་དད་པའི་དབང་དུ་མཐོང་། །
en: I remain in its brilliance throughout the three times, In a form of body in accordance with the wishes of beings, Which they all see through the power of their faith.

source: ཁོ་མོའི་སེམས་ནི་ཆགས་མེད་ཟག་པ་མེད། །
en: {13} “My mind is without attachment, undefiled.

source: སྒྲ་དབྱངས་སྤྲིན་གྱི་ང་རོ་ཇི་བཞིན་ཏེ། །
en: The sound of speech is like the roaring of the clouds.

source: དེ་ཡི་ཁོངས་སུ་མི་མཆོག་ཀུན་ཆུད་ཀྱང་། །དེ་ལ་ཁོ་མོ་རྣམ་པར་རྟོག་པ་མེད། །
en: Though all lords of humans are contained in it, I have no conceptualization concerning that.

source: ཞིང་གི་དབྱིངས་ཀྱི་སེམས་ཅན་བསམ་མི་ཁྱབ། །དེ་དག་སེམས་ཀྱི་རྒྱ་མཚོ་ཁོ་མོས་ཤེས། །
en: {14} “I know the ocean of the minds Of the countless beings in the realms.

source: དེ་དག་དབང་པོ་བསམ་པ་རབ་ཤེས་ཀྱང་། །དེ་ལ་ཁོ་མོ་རྣམ་པར་རྟོག་པ་མེད། །
en: I know their faculties and aspirations, But in this I have no conceptualization.

source: ཁོ་མོའི་རྫུ་འཕྲུལ་རབ་ཡངས་ཤིན་ཏུ་གྲུབ། །
en: {15} “My miracles are vast and perfectly performed.

source: དེས་ནི་བསམ་ཡས་ཞིང་ཡང་རབ་ཏུ་བསྐྱོད། །
en: They are inconceivable and shake the realms.

source: ལུས་ཀྱི་འོད་དང་མཐུ་ཡང་དེ་བཞིན་ཏེ། །དེས་ནི་སེམས་ཅན་གདུལ་དཀའ་ཤིན་ཏུ་འདུལ། །
en: Similarly, the light and power of my body Subdue the beings who are difficult to subdue.

source: ཁོ་མོའི་བསོད་ནམས་རྣམ་ཡངས་ཡོངས་སུ་དག །ཀུན་ཏུ་རྒྱན་བྱེད་ཟད་པ་མེད་པའི་མཛོད། །དེས་ནི་རྒྱལ་བ་རྣམས་ལ་མཆོད་པ་བྱེད། །འགྲོ་བ་ཐམས་ཅད་ཉེ་བར་འཚོ་བའང་ཡིན། །
en: {16} “My merit is vast and completely pure, An inexhaustible treasure completely displayed, Through which offerings are made to the jinas And all beings are sustained.

source: ཁོ་མོའི་ཤེས་རབ་རྣམ་ཡངས་ཤིན་ཏུ་དག །དེས་ནི་ཆོས་མང་རྒྱ་མཚོ་རབ་ཏུ་ཤེས། །འགྲོ་བ་ཀུན་གྱི་ཐེ་ཚོམ་ཡོངས་སུ་གཅོད། །
en: {17} “Vast and completely pure is my wisdom, Through which I know an ocean of Dharma And cut through the doubts of all beings.
